public class Main {
    public static void main(String[] args) {
//        Ответить на вопросы (письменно):
//        1 Как организовать клиент-серверное взаимодействие?
//        через Socket/Channel
//
//         3 Как и в каком виде передавать файлы
//         побайтово через FIleInputStream/OutputStream
//
//        2 Как пересылать большие файлы?
//       Передавать разбивая на части.

//        4 Как пересылать служебные команды?
//          Сощдать обыект и класс которые будут считывать сообщения на сервер и определять команда
//
//        5 Что хранить в базе данных?
//        Данные клиента, файлы .
//
//        6 Как передавать структуру каталогов/файлов
//          пофайлово  передавая метаданные файла.
//
//        7 Какую библиотеку использовать для сетевого взаимодействия: java.io, java.nio, Netty?
//        Netty

    }
}
